/* ©2015-2016 Beijing Bechade Opto-Electronic, Co.,Ltd. All rights reserved.
 + 文件名  device_ms5611.h
 + 描述    ：气压计设备头文件
代码尽量做到逐行注释 代码有问题，及时加群交流 作者有偿支持对开源代码的完善 */
#ifndef _DEVICE_MS5611_H
#define _DEVICE_MS5611_H

#include "stm32f4xx.h"

/*----------------------------------------------------------
 + 实现功能：气压计复位
----------------------------------------------------------*/
extern void MS5611_Reset(void);

/*----------------------------------------------------------
 + 实现功能：读取气压计PORM存储器 并判断硬件故障
----------------------------------------------------------*/
extern u8 MS5611_Read_Prom(uint16_t * ms5611_prom8);

/*----------------------------------------------------------
 + 实现功能：读取测量数据
----------------------------------------------------------*/
extern void MS5611_Read_measure(u8 * rxbuf);

/*----------------------------------------------------------
 + 实现功能：开始读取温度
----------------------------------------------------------*/
extern void MS5611_Start_T(void);

/*----------------------------------------------------------
 + 实现功能：开始读取气压
----------------------------------------------------------*/
extern void MS5611_Start_P(void);

#endif
/* ©2015-2016 Beijing Bechade Opto-Electronic, Co.,Ltd. All rights reserved. */
